[
    {
      "name": "Ir. Soekarno",
      "keterangan": "Proklamator Kemerdekaan",
      "nama_gelar": "Dr. (H.C.) Ir. H. Soekarno",
      "kategori": "Proklamator Kemerdekaan Indonesia",
      "nama_lengkap": "Koesno Sosrodihardjo",
      "lahir":"6 Juni 1901",
      "wafat":"21 Juni 1970",
      "riwayat_hidup": "Soekarno dilahirkan dengan seorang ayah yang bernama Raden Soekemi Sosrodihardjo (1873–1945) dan ibunya yaitu Ida Ayu Nyoman Rai (1881–1958). Keduanya bertemu ketika Raden Soekemi yang merupakan seorang guru ditempatkan di Sekolah Dasar Pribumi di Singaraja, Bali. Nyoman Rai merupakan keturunan bangsawan dari Bali dan beragama Hindu, sedangkan Raden Soekemi sendiri beragama Islam. Mereka telah memiliki seorang putri yang bernama Sukarmini sebelum Soekarno lahir.:4-6, 247-251 Ketika kecil Soekarno tinggal bersama kakeknya, Raden Hardjokromo di Tulung Agung, Jawa Timur. Ia bersekolah pertama kali di Tulung Agung hingga akhirnya ia pindah ke Mojokerto, mengikuti orangtuanya yang ditugaskan di kota tersebut. Di Mojokerto, ayahnya memasukkan Soekarno ke Eerste Inlandse School, sekolah tempat ia bekerja. Kemudian pada Juni 1911 Soekarno dipindahkan ke Europeesche Lagere School (ELS) untuk memudahkannya diterima di Hogere Burger School (HBS). Pada tahun 1915, Soekarno telah menyelesaikan pendidikannya di ELS dan berhasil melanjutkan ke HBS di Surabaya, Jawa Timur. Ia dapat diterima di HBS atas bantuan seorang kawan bapaknya yang bernama H.O.S. Tjokroaminoto. Tjokroaminoto bahkan memberi tempat tinggal bagi Soekarno di pondokan kediamannya. Di Surabaya, Soekarno banyak bertemu dengan para pemimpin Sarekat Islam, organisasi yang dipimpin Tjokroaminoto saat itu, seperti Alimin, Musso, Darsono, Haji Agus Salim, dan Abdul Muis. Soekarno kemudian aktif dalam kegiatan organisasi pemuda Tri Koro Dharmo yang dibentuk sebagai organisasi dari Budi Utomo. Nama organisasi tersebut kemudian ia ganti menjadi Jong Java (Pemuda Jawa) pada 1918. Selain itu, Soekarno juga aktif menulis di harian Oetoesan Hindia yang dipimpin oleh Tjokroaminoto. Soekarno sewaktu menjadi siswa HBS Soerabaja Soekarno bersama mahasiswa pribumi TH Bandung tahun 1923. Baris belakang dari kiri ke kanan: M. Anwari, Soetedjo, Soetojo, Soekarno, R. Soemani, Soetono, R. M. Koesoemaningrat, Djokoasmo, Marsito. Duduk di depan: Soetoto, M. Hoedioro, Katamso. Tamat HBS Soerabaja bulan Juli 1921, bersama Djoko Asmo rekan satu angkatan di HBS, Soekarno melanjutkan ke Technische Hoogeschool te Bandoeng (sekarang ITB) di Bandung dengan mengambil jurusan teknik sipil pada tahun 1921,:38 setelah dua bulan dia meninggalkan kuliah, tetapi pada tahun 1922 mendaftar kembali:38 dan tamat pada tahun 1926. Soekarno dinyatakan lulus ujian insinyur pada tanggal 25 Mei 1926 dan pada Dies Natalis ke-6 TH Bandung tanggal 3 Juli 1926 dia diwisuda bersama delapan belas insinyur lainnya.:37 Prof. Jacob Clay selaku ketua fakultas pada saat itu menyatakan Terutama penting peristiwa itu bagi kita karena ada di antaranya 3 orang insinyur orang Jawa.[3]:37 Mereka adalah Soekarno, Anwari, dan Soetedjo,[16]:167 selain itu ada seorang lagi dari Minahasa yaitu Johannes Alexander Henricus Ondang.[16]:167 Saat di Bandung, Soekarno tinggal di kediaman Haji Sanusi yang merupakan anggota Sarekat Islam dan sahabat karib Tjokroaminoto. Di sana ia berinteraksi dengan Ki Hajar Dewantara, Tjipto Mangunkusumo, dan Dr. Douwes Dekker, yang saat itu merupakan pemimpin organisasi National Indische Partij."
    },
    {
      "name": "Moh. Hatta",
      "keterangan": "Wakil Presiden Indonesia",
      "nama_gelar": "Dr. (H.C.) Drs. H. Mohammad Hatta",
      "kategori": "Pejuang Kemerdekaan Indonesia",
      "nama_lengkap": "Mohammad Hatta",
      "lahir":"12 Agustus 1902",
      "wafat":"4 Maret 1980",
      "riwayat_hidup": "Mohammad Hatta lahir dari pasangan Muhammad Djamil dan Siti Saleha yang berasal dari Minangkabau. Ayahnya merupakan seorang keturunan ulama Naqsyabandiyah di Batuhampar, dekat Payakumbuh, Sumatera Barat dan ibunya berasal dari keluarga pedagang di Bukittinggi. Ia lahir dengan nama Muhammad Athar pada tanggal 12 Agustus 1902. Namanya, Athar berasal dari bahasa Arab, yang berarti harum. Athar lahir sebagai anak kedua, setelah Rafiah yang lahir pada tahun 1900. Sejak kecil, ia telah dididik dan dibesarkan dalam lingkungan keluarga yang taat melaksanakan ajaran agama Islam. Kakeknya dari pihak ayah, Abdurrahman Batuhampar dikenal sebagai ulama pendiri Surau Batuhampar, sedikit dari surau yang bertahan pasca-Perang Padri. Sementara itu, ibunya berasal dari keturunan pedagang. Beberapa orang mamaknya adalah pengusaha besar di Jakarta. Ayahnya meninggal pada saat ia masih berumur tujuh bulan. Setelah kematian ayahnya, ibunya menikah dengan Agus Haji Ning, seorang pedagang dari Palembang. Haji Ning sering berhubungan dagang dengan Ilyas Bagindo Marah, kakeknya dari pihak ibu. Perkawinan Siti Saleha dengan Haji Ning melahirkan empat orang anak, yang semuanya adalah perempuan. Mohammad Hatta pertama kali mengenyam pendidikan formal di sekolah swasta. Setelah enam bulan, ia pindah ke sekolah rakyat dan sekelas dengan Rafiah, kakaknya. Namun, pelajarannya berhenti pada pertengahan semester kelas tiga. Ia lalu pindah ke ELS di Padang (kini SMA Negeri 1 Padang) sampai tahun 1913, dan melanjutkan ke MULO sampai tahun 1917. Di luar pendidikan formal, ia pernah belajar agama kepada Muhammad Jamil Jambek, Abdullah Ahmad, dan beberapa ulama lainnya. Selain keluarga, perdagangan memengaruhi perhatian Hatta terhadap perekonomian. Di Padang, ia mengenal pedagang-pedagang yang masuk anggota Serikat Oesaha dan aktif dalam Jong Sumatranen Bond sebagai bendahara. Kegiatannya ini tetap dilanjutkannya ketika ia bersekolah di Prins Hendrik School. Mohammad Hatta tetap menjadi bendahara di Jakarta. Kakeknya bermaksud akan ke Mekkah, dan pada kesempatan tersebut, ia dapat membawa Mohammad Hatta melanjutkan pelajaran di bidang agama, yakni ke Mesir (Al-Azhar). Ini dilakukan untuk meningkatkan kualitas surau di Batuhmpar yang memang sudah menurun sejak meninggalnya Abdurrahman. Namun, hal ini diprotes dan mengusulkan pamannya, Idris untuk menggantikannya. Menurut catatan Amrin Imran, Pak Gaeknya kecewa dan Syekh Arsyad pada akhirnya menyerahkan kepada Tuhan."
    },
    {
      "name": "R.A. Kartini",
      "keterangan": "Pahlawan Emansipasi",
      "nama_gelar": "Raden Ajeng Kartini",
      "kategori": "Pahlawan Emansipasi Wanita Indonesia",
      "nama_lengkap": "Raden Adjeng Kartini",
      "lahir":"21 April 1879",
      "wafat":"17 September 1904",
      "riwayat_hidup": "Raden Adjeng Kartini berasal dari kalangan priayi atau kelas bangsawan Jawa. Ia merupakan putri dari Raden Mas Adipati Ario Sosroningrat, seorang patih yang diangkat menjadi bupati Jepara segera setelah Kartini lahir. Kartini adalah putri dari istri pertama, tetapi bukan istri utama. Ibunya bernama M.A. Ngasirah, putri dari Nyai Haji Siti Aminah dan Kyai Haji Madirono, seorang guru agama di Telukawur, Jepara. Dari sisi ayahnya, silsilah Kartini dapat dilacak hingga Hamengkubuwana VI. Garis keturunan Bupati Sosroningrat bahkan dapat ditilik kembali ke istana Kerajaan Majapahit. Semenjak Pangeran Dangirin menjadi bupati Surabaya pada abad ke-18, nenek moyang Sosroningrat mengisi banyak posisi penting di Pangreh Praja. Ayah Kartini pada mulanya adalah seorang wedana di Mayong. Peraturan kolonial waktu itu mengharuskan seorang bupati beristerikan seorang bangsawan. Karena M.A. Ngasirah bukanlah bangsawan tinggi, maka ayahnya menikah lagi dengan Raden Adjeng Woerjan (Moerjam), keturunan langsung Raja Madura. Setelah perkawinan itu, ayah Kartini diangkat menjadi bupati di Jepara menggantikan kedudukan ayah kandung R.A. Woerjan, R.A.A. Tjitrowikromo. Kartini adalah anak ke-5 dari 11 bersaudara kandung dan tiri. Dari semua saudara sekandung, Kartini adalah anak perempuan tertua. Kakeknya, Pangeran Ario Tjondronegoro IV, diangkat bupati dalam usia 25 tahun dan dikenal pada pertengahan abad ke-19 sebagai salah satu bupati pertama yang memberi pendidikan Barat kepada anak-anaknya. Kakak Kartini, Sosrokartono, adalah seorang yang pintar dalam bidang bahasa. Sampai usia 12 tahun, Kartini diperbolehkan bersekolah di Europeesche Lagere School (ELS). Di sini Kartini belajar bahasa Belanda. Namun, setelah usia 12 tahun, ia harus tinggal di rumah karena harus dipingit. Surat Kartini - Rosa Abendanon (fragmen) Karena Kartini bisa berbahasa Belanda, di rumah ia mulai belajar sendiri dan menulis surat kepada teman-teman korespondensi yang berasal dari Belanda. Salah satunya adalah Rosa Abendanon yang banyak mendukungnya. Dari buku-buku, koran, dan majalah Eropa, Kartini tertarik pada kemajuan berpikir perempuan Eropa. Timbul keinginannya untuk memajukan perempuan pribumi karena ia melihat bahwa perempuan pribumi berada pada status sosial yang rendah."
    },
    {
      "name": "Ki Hajar Dewantara",
      "keterangan": "Aktivis Kemerdekaan",
      "nama_gelar": "Dr.H.C Ki Hajar Dewantara",
      "kategori": "Aktivis Kemerdekaan Indonesia",
      "nama_lengkap": "Raden Mas Soewardi Soerjaningrat",
      "lahir":"2 Mei 1889",
      "wafat":"26 April 1959",
      "riwayat_hidup": "Soewardi berasal dari lingkungan keluarga bangsawan Kadipaten Pakualaman. Ia merupakan putra dari GPH Soerjaningrat dan cucu dari Paku Alam III. Ia menamatkan pendidikan dasar di Europeesche Lagere School. Sekolah ini merupakan sekolah dasar khusus untuk anak-anak yang berasal dari Eropa. Ia sempat melanjukan pendidikan kedokteran di STOVIA. Namun, ia tidak menamatkannya karena kondisi kesehatan yang buruk. Kemudian ia bekerja sebagai penulis dan wartawan di beberapa surat kabar. Ia pernah bekerja untuk surat kabar Sediotomo, Midden Java, De Expres, Oetoesan Hindia, Kaoem Moeda, Tjahaja Timoer, dan Poesara. Ia tergolong salah seorang penulis yang handal pada masanya. Gaya tulisannya bersifat komunikatif dengan gagasan-gagasan yang antikolonial. Sewaktu pemerintah Hindia Belanda berniat mengumpulkan sumbangan dari warga, termasuk pribumi, untuk perayaan kemerdekaan Belanda dari Prancis pada tahun 1913, timbul reaksi kritis dari kalangan nasionalis, termasuk Soewardi. Ia kemudian menulis 'Een voor Allen maar Ook Allen voor Een' atau 'Satu untuk Semua, tetapi Semua untuk Satu Juga'. Namun kolom KHD yang paling terkenal adalah 'Seandainya Aku Seorang Belanda' (judul asli: 'Als ik een Nederlander was'), dimuat dalam surat kabar De Expres pimpinan DD, 13 Juli 1913. Isi artikel ini terasa pedas sekali di kalangan pejabat Hindia Belanda. Kutipan tulisan tersebut antara lain sebagai berikut. 'Sekiranya aku seorang Belanda, aku tidak akan menyelenggarakan pesta-pesta kemerdekaan di negeri yang telah kita rampas sendiri kemerdekaannya. Sejajar dengan jalan pikiran itu, bukan saja tidak adil, tetapi juga tidak pantas untuk menyuruh si inlander memberikan sumbangan untuk dana perayaan itu. Ide untuk menyelenggaraan perayaan itu saja sudah menghina mereka, dan sekarang kita keruk pula kantongnya. Ayo teruskan saja penghinaan lahir dan batin itu! Kalau aku seorang Belanda, hal yang terutama menyinggung perasaanku dan kawan-kawan sebangsaku ialah kenyataan bahwa inlander diharuskan ikut mengongkosi suatu kegiatan yang tidak ada kepentingan sedikit pun baginya'. Beberapa pejabat Belanda menyangsikan tulisan ini asli dibuat oleh Soewardi sendiri karena gaya bahasanya yang berbeda dari tulisan-tulisannya sebelum ini. Kalaupun benar ia yang menulis, mereka menganggap DD berperan dalam memanas-manasi Soewardi untuk menulis dengan gaya demikian. Akibat tulisan ini ia ditangkap atas persetujuan Gubernur Jenderal Idenburg dan akan diasingkan ke Pulau Bangka (atas permintaan sendiri). Namun demikian kedua rekannya, DD dan Tjipto Mangoenkoesoemo, memprotes dan akhirnya mereka bertiga diasingkan ke Belanda (1913). Ketiga tokoh ini dikenal sebagai 'Tiga Serangkai'. Soewardi kala itu baru berusia 24 tahun."
    },
    {
      "name": "Jenderal Soedirman",
      "keterangan": "Panglima Besar Nasional",
      "nama_gelar": "Jenderal Soedirman",
      "kategori": "Pahlawan Revolusi Indonesia",
      "nama_lengkap": "Soedirman",
      "lahir":"24 Januari 1916",
      "wafat":"29 Januari 1950",
      "riwayat_hidup": "Soedirman lahir dari pasangan Karsid Kartawiraji dan Siyem saat pasangan ini tinggal di rumah saudari Siyem yang bernama Tarsem di Bodaskarangdjati, Rembang, Purbalingga. Tarsem sendiri bersuamikan seorang camat bernama Raden Cokrosunaryo. Menurut catatan keluarga, Soedirman dinamai oleh pamannya lahir pada Minggu pon di bulan Maulud dalam penanggalan Jawa; pemerintah Indonesia kemudian menetapkan 24 Januari 1916 sebagai hari ulang tahun Soedirman. Karena kondisi keuangan Cokrosunaryo yang lebih baik, ia mengadopsi Soedirman dan memberinya gelar Raden, gelar kebangsawanan pada suku Jawa. Soedirman tidak diberitahu bahwa Cokrosunaryo bukanlah ayah kandungnya sampai ia berusia 18 tahun. Setelah Cokrosunaryo pensiun sebagai camat pada akhir 1916, Soedirman ikut dengan keluarganya ke Manggisan, Cilacap. Di tempat inilah ia tumbuh besar. Di Cilacap, Karsid dan Siyem memiliki seorang putra lain bernama Muhammad Samingan. Karsid meninggal dunia saat Soedirman berusia enam tahun, dan Siyem menitipkan kedua putranya pada saudara iparnya dan kembali ke kampung halamannya di Parakan Onje, Ajibarang. Soedirman dibesarkan dengan cerita-cerita kepahlawanan, juga diajarkan etika dan tata krama priyayi, serta etos kerja dan kesederhanaan wong cilik, atau rakyat jelata. Untuk pendidikan agama, ia dan adiknya mempelajari Islam di bawah bimbingan Kyai Haji Qahar; Soedirman adalah anak yang taat agama dan selalu shalat tepat waktu. Ia dipercaya untuk mengumandangkan adzan dan iqamat. Saat berusia tujuh tahun, Soedirman terdaftar di sekolah pribumi (hollandsch inlandsche school). Meskipun hidup berkecukupan, keluarga Soedirman bukanlah keluarga kaya. Selama menjabat sebagai camat, Cokrosunaryo tidak mengumpulkan banyak kekayaan, dan di Cilacap ia bekerja sebagai penyalur mesin jahit Singer. Pada tahun kelimanya bersekolah, Soedirman diminta untuk berhenti sekolah sehubungan dengan ejekan yang diterimanya di sekolah milik pemerintah; permintaan ini awalnya ditolak, namun Soedirman dipindahkan ke sekolah menengah milik Taman Siswa pada tahun ketujuh sekolah. Pada tahun kedelapan, Soedirman pindah ke Sekolah Menengah Wirotomo[e] setelah sekolah Taman Siswa ditutup oleh Ordonansi Sekolah Liar karena diketahui tidak terdaftar. Kebanyakan guru Soedirman di Wirotomo adalah nasionalis Indonesia, yang turut mempengaruhi pandangannya terhadap penjajah Belanda. Soedirman belajar dengan tekun di sekolah; gurunya Suwarjo Tirtosupono menyatakan bahwa Soedirman sudah mempelajari pelajaran tingkat dua pada saat kelas masih mempelajari pelajaran tingkat satu. Meskipun lemah dalam pelajaran kaligrafi Jawa, Soedirman sangat pintar dalam pelajaran matematika, ilmu alam, dan menulis, baik bahasa Belanda maupun Indonesia. Soedirman juga menjadi semakin taat agama di bawah bimbingan gurunya, Raden Muhammad Kholil. Teman-teman sekelasnya memanggilnya haji karena ketaatannya dalam beribadah, dan Soedirman juga memberikan ceramah agama kepada siswa lain. Selain belajar dan beribadah, Soedirman juga berpartisipasi dalam kelompok musik sekolah dan bergabung dengan tim sepak bola sebagai bek. Kematian Cokrosunaryo pada tahun 1934 menyebabkan keluarganya jatuh miskin, namun ia tetap diizinkan untuk melanjutkan sekolahnya tanpa membayar sampai ia lulus pada akhir tahun. Setelah kepergian ayah tirinya, Soedirman mencurahkan lebih banyak waktunya untuk mempelajari Sunnah dan doa. Pada usia 19 tahun, Soedirman menjadi guru praktik di Wirotomo. Saat bersekolah di Wirotomo, Soedirman adalah anggota Perkumpulan Siswa Wirotomo, klub drama, dan kelompok musik. Ia membantu mendirikan cabang Hizboel Wathan, sebuah organisasi Kepanduan Putra milik Muhammadiyah. Soedirman menjadi pemimpin Hizboel Wathan cabang Cilacap setelah lulus dari Wirotomo; tugasnya adalah menentukan dan merencanakan kegiatan kelompoknya. Soedirman menekankan perlunya pendidikan agama, bersikeras bahwa kontingen dari Cilacap harus menghadiri konferensi Muhammadiyah di seluruh Jawa. Ia mengajari para anggota muda Hizboel Wathan[f] tentang sejarah Islam dan pentingnya moralitas, sedangkan pada anggota yang lebih tua ia berlakukan disiplin militer."
    },
    {
      "name": "Cut Nyak Dien",
      "keterangan": "Pejuang Kemerdekaan Aceh",
      "nama_gelar": "Teungku Chik di Tiro",
      "kategori": "Pahlawan Nasional Indonesia",
      "nama_lengkap": "Teungku Chik di Tiro",
      "lahir":"12 Mei 1848",
      "wafat":"6 November 1908",
      "riwayat_hidup": "Cut Nyak Dhien dilahirkan dari keluarga bangsawan yang taat beragama di Aceh Besar, wilayah VI Mukim pada tahun 1848. Ayahnya bernama Teuku Nanta Seutia, seorang uleebalang VI Mukim, yang juga merupakan keturunan Datuk Makhudum Sati, perantau dari Minangkabau. Datuk Makhudum Sati merupakan keturunan dari Laksamana Muda Nanta yang merupakan perwakilan Kesultanan Aceh pada zaman pemerintahan Sultan Iskandar Muda di Pariaman. Datuk Makhudum Sati mungkin datang ke Aceh pada abad ke 18 ketika kesultanan Aceh diperintah oleh Sultan Jamalul Badrul Munir. Sedangkan ibunya merupakan putri uleebalang Lampageu. Pada masa kecilnya, Cut Nyak Dhien adalah anak yang cantik. Ia memperoleh pendidikan pada bidang agama (yang dididik oleh orang tua ataupun guru agama) dan rumah tangga (memasak, melayani suami, dan yang menyangkut kehidupan sehari-hari yang dididik baik oleh orang tuanya). Banyak laki-laki yang suka pada Cut Nyak Dhien dan berusaha melamarnya. Pada usia 12 tahun, ia sudah dinikahkan oleh orangtuanya pada tahun 1862 dengan Teuku Cek Ibrahim Lamnga, putra dari uleebalang Lamnga XIII. Mereka memiliki satu anak laki-laki."
    },
    {
      "name": "Tjokroaminoto",
      "keterangan": "Pendiri Sarekat Islam",
      "nama_gelar": "H.O.S. Tjokroaminoto",
      "kategori": "Pahlawan Nasional Indonesia",
      "nama_lengkap":"Tjokroaminoto",
      "lahir":"16 Agustus 1882",
      "wafat":"17 Desember 1934",
      "riwayat_hidup": "Tjokroaminoto adalah anak kedua dari 12 bersaudara dari ayah bernama R.M. Tjokroamiseno, salah seorang pejabat wedana Kleco, Magetan pada saat itu. Kakeknya, R.M. Adipati Tjokronegoro, pernah juga menjabat sebagai Bupati Ponorogo, Mertuanya adalah R.M. Mangoensoemo yang merupakan wakil bupati Ponorogo. Beliau adalah keturunan langsung dari Kiai Ageng Hasan Besari dari Pondok Pesantren Tegalsari Ponorogo Setelah lulus dari sekolah rendah, ia melanjutkan pendidikannya di sekolah pamong praja Opleiding School voor Inlandsche Ambtrnaren (OSVIA) di Magelang. Setelah lulus, ia bekerja sebagai juru tulis patih di Ngawi. Tiga tahun kemudian, ia berhenti. Tjokromaninoto pindah dan menetap di Surabaya pada 1906. Di Surabaya, ia bekerja sebagai juru tulis di firma Inggris Kooy & Co dan melanjutkan pendidikannya di sekolah kejuruan Burgerlijk Avondschool, jurusan Teknik Mesin. Salah satu trilogi darinya yang termasyhur adalah Setinggi-tinggi ilmu, semurni-murni tauhid, sepintar-pintar siasat. Ini menggambarkan suasana perjuangan Indonesia pada masanya yang memerlukan tiga kemampuan pada seorang pejuang kemerdekaan. Dari berbagai muridnya yang paling ia sukai adalah Soekarno hingga ia menikahkan Soekarno dengan anaknya yakni Siti Oetari, istri pertama Soekarno. Pesannya kepada Para murid-muridnya ialah Jika kalian ingin menjadi Pemimpin besar, menulislah seperti wartawan dan bicaralah seperti orator. Perkataan ini membius murid-muridnya hingga membuat Soekarno setiap malam berteriak belajar pidato hingga membuat kawannya, Muso, Alimin, S.M. Kartosuwiryo, Darsono, dan yang lainnya terbangun dan tertawa menyaksikannya."
    },
    {
      "name": "Tan Malaka",
      "keterangan": "Pejuang Kemerdekaan",
      "nama_gelar": "Ibrahim Gelar Datuk Sutan Malaka",
      "kategori": "Pahlawan Revolusi Indonesia",
      "nama_lengkap": "Ibrahim Gelar Datuk Sutan Malaka",
      "lahir":" 2 Juni 1897",
      "wafat":"21 Februari 1949",
      "riwayat_hidup": "Nama lengkap Tan Malaka adalah Ibrahim Gelar Datuk Sutan Malaka. Nama aslinya adalah Ibrahim, tetapi ia dikenal baik sebagai seorang anak dan orang dewasa sebagai Tan Malaka, sebuah nama kehormatan dan semi-bangsawan, ia mewarisi dari latar belakang bangsawan ibunya. Ia lahir di Nagari Pandam Gadang, Kabupaten Lima Puluh Kota, Sumatera Barat, yang saat itu berada di bawah kekuasaan Hindia Belanda. Tanggal lahirnya tidak jelas, dan bervariasi dari sumber ke sumber, tetapi kemungkinan antara tahun 1894 dan 1897. Ayahnya adalah HM. Rasad Caniago, seorang buruh tani, dan ibunya, Rangkayo Sinah Simabur, putri seorang tokoh terpandang di desa tersebut. Sebagai seorang anak, Tan Malaka tinggal bersama orang tuanya di Suliki, dan belajar ilmu agama dan dilatih dalam seni bela diri pencak silat. Pada tahun 1908, Tan Malaka bersekolah di Kweekschool, sekolah guru negeri, di Fort de Kock. Di Kweekschool, Tan Malaka belajar bahasa Belanda dan menjadi pemain sepak bola yang terampil. Menurut gurunya, G. H. Horensma, meskipun Tan terkadang tidak patuh, dia adalah murid yang sangat baik. Ia lulus pada tahun 1913, dan kembali ke desanya. Kepulangannya akan ditandai dengan penganugerahan gelar adat yang tinggi sebagai datuk dan tawaran tunangan. Namun, dia hanya menerima gelar. Dia berhasil mendapatkan uang dari desa untuk melanjutkan pendidikannya ke luar negeri, dan dia berlayar ke Rotterdam pada tahun yang sama."
    },
    {
      "name": "Diponegoro",
      "keterangan": "Pahlawan Perang",
      "nama_gelar": "Pangeran Diponegoro",
      "kategori": "Pahlawan Nasional Indonesia",
      "nama_lengkap": "Pangeran Diponegoro",
      "lahir":"11 November 1785",
      "wafat":"8 Januari 1855",
      "riwayat_hidup": "Diponegoro lahir di Yogyakarta pada tanggal 11 November 1785 dari ibu yang merupakan seorang selir (garwa ampeyan), bernama R.A. Mangkarawati, dari Pacitan dan ayahnya bernama Gusti Raden Mas Suraja, yang di kemudian hari naik takhta bergelar Hamengkubuwana III. Pangeran Diponegoro sewaktu dilahirkan bernama Bendara Raden Mas Mustahar, kemudian diubah menjadi Bendara Raden Mas Antawirya. Nama Islamnya adalah Abdul Hamid. Setelah ayahnya naik takhta, Bendara Raden Mas Antawirya diwisuda sebagai pangeran dengan nama Bendara Pangeran Harya Dipanegara. Ketika dewasa, Pangeran Diponegoro menolak keinginan sang ayah untuk menjadi raja. Ia sendiri beralasan bahwa posisi ibunya yang bukan sebagai istri permaisuri, membuat dirinya merasa tidak layak untuk menduduki jabatan tersebut. Pangeran Diponegoro dikenal sebagai pribadi yang cerdas, banyak membaca, dan ahli di bidang hukum Islam-Jawa. Dia juga lebih tertarik pada masalah-masalah keagamaan ketimbang masalah pemerintahan keraton dan membaur dengan rakyat. Sang Pangeran juga lebih memilih tinggal di Tegalrejo, berdekatan dengan tempat tinggal eyang buyut putrinya, yakni Gusti Kangjeng Ratu Tegalrejo, permaisuri dari Sultan Hamengkubuwana I, daripada tinggal di keraton. Pangeran Diponegoro adalah seorang yang menggemari kuda dan saat di Tegalrejo sebelum perang memiliki lebih dari 60 orang Jawa untuk memelihara kudanya. Bak-bak air besar dari tembok untuk memberi minum kudanya masih terlihat sampai kini (2021). Kandang kuda dan istal Pangeran begitu luas sampai Sentot muda, yang datang untuk hidup di Tegalrejo saat berumur 6 tahun setelah kakak perempuannya, Raden Ayu Maduretno menikah dengan Pangeran, lebih mementingkan belajar naik kuda daripada menjadi santri. Saat mulai pecahnya Perang Jawa, kuda kekar hitam tunggangan Dipnegoro, Kiai Gitayu (Gentayu) dan ketangkasannya dia tas pelana dicatat oleh komandan kavaleri Belanda. Saat perang, keahlian Pangeran menunggang kuda sangat membantu dirinya untuk selamat ketika sering bisa menghindari pengejaran di medan yang sulit, terutama waktu menyeberang Kali Progo, dimana Pangeran mengetahui semua area dangkal yang bisa dipakai untuk mengarungi sungai lebar itu tanpa dihanyutkan air. Pangeran Diponegoro mulai menaruh perhatian pada masalah keraton ketika dirinya ditunjuk menjadi salah satu anggota perwalian untuk mendampingi Sultan Hamengkubuwana V (1822) yang saat itu baru berusia 3 tahun. Karena baru berusia 3 tahun, pemerintahan keraton sehari-hari dikendalikan oleh Patih Danureja IV dan Residen Belanda. Pangeran Diponegoro tidak menyetujui cara perwalian seperti itu, sehingga dia melakukan protes."
    },
    {
      "name": "Teuku Umar",
      "keterangan": "Pahlawan Nasional",
      "nama_gelar": "Teuku Umar",
      "kategori": "Pahlawan Kemerdekaan Indonesia",
      "nama_lengkap": "Teuku Umar",
      "lahir":"1854",
      "wafat":"11 Februari 1899",
      "riwayat_hidup": "Teuku Umar yang dilahirkan di Meulaboh Aceh Barat pada tahun 1854, adalah anak seorang Uleebalang bernama Teuku Achmad Mahmud dari perkawinan dengan adik perempuan Raja Meulaboh. Umar mempunyai dua orang saudara perempuan dan tiga saudara laki-laki. Nenek moyang Umar adalah Datuk Makhudum Sati berasal dari Minangkabau. Dia merupakan keturunan dari Laksamana Muda Nanta yang merupakan perwakilan Kesultanan Aceh pada zaman pemerintahan Sultan Iskandar Muda di Pariaman. Salah seorang keturunan Datuk Makhudum Sati pernah berjasa terhadap Sultan Aceh, yang pada waktu itu terancam oleh seorang Panglima Sagi yang ingin merebut kekuasaannya. Berkat jasanya tersebut, orang itu diangkat menjadi Uleebalang VI Mukim dengan gelar Teuku Nan Ranceh. Teuku Nan Ranceh mempunyai dua orang putra yaitu Teuku Nanta Setia dan Teuku Ahmad Mahmud. Sepeninggal Teuku Nan Ranceh, Teuku Nanta Setia menggantikan kedudukan ayahnya sebagai Uleebalang VI Mukim. la mempunyai anak perempuan bernama Cut Nyak Dhien. Teuku Umar dari kecil dikenal sebagai anak yang cerdas, pemberani, dan kadang suka berkelahi dengan teman-teman sebayanya. Ia juga memiliki sifat yang keras dan pantang menyerah dalam menghadapi segala persoalan. Teuku Umar tidak pernah mendapakan pendidikan formal. Meski demikian, ia mampu menjadi seorang pemimpin yang kuat, cerdas, dan pemberani."
    },
    {
      "name": "Mohammad Natsir",
      "keterangan": "Ulama Indonesia",
      "nama_gelar": "Mohammad Natsir",
      "kategori": "Pahlawan Nasional Indonesia",
      "nama_lengkap": "Mohammad Natsir",
      "lahir":"17 Juli 1908",
      "wafat":"6 Februari 1993",
      "riwayat_hidup": "Mohammad Natsir dilahirkan di Alahan Panjang, Lembah Gumanti, Kabupaten Solok, Sumatera Barat pada 17 Juli 1908 dari pasangan Mohammad Idris Sutan Saripado dan Khadijah. Pada masa kecilnya, Natsir sekeluarga hidup di rumah Sutan Rajo Ameh, seorang saudagar kopi yang terkenal di sana. Oleh pemiliknya, rumah itu dibelah menjadi kedua bagian: pemilik rumah beserta keluarga tinggal di bagian kiri dan Mohammad Idris Sutan Saripado tinggal di sebelah kanannya. Ia memiliki 3 orang saudara kandung, masing-masing bernama Yukinan, Rubiah, dan Yohanusun. Jabatan terakhir ayahnya adalah sebagai pegawai pemerintahan di Alahan Panjang, sedangkan kakeknya merupakan seorang ulama. Ia kelak menjadi pemangku adat untuk kaumnya yang berasal dari Maninjau, Tanjung Raya, Agam dengan gelar Datuk Sinaro nan Panjang. Natsir mulai mengenyam pendidikan di Sekolah Rakyat Maninjau selama dua tahun hingga kelas dua, kemudian pindah ke Hollandsch-Inlandsche School (HIS) Adabiyah di Padang. Setelah beberapa bulan, ia pindah lagi ke Solok dan dititipkan di rumah saudagar yang bernama Haji Musa. Selain belajar di HIS di Solok pada siang hari, ia juga belajar ilmu agama Islam di Madrasah Diniyah pada malam hari. Tiga tahun kemudian, ia kembali pindah ke HIS di Padang bersama kakaknya. Pada tahun 1923, ia melanjutkan pendidikannya di Meer Uitgebreid Lager Onderwijs (MULO) lalu ikut bergabung dengan perhimpunan-perhimpunan pemuda seperti Pandu Nationale Islamietische Pavinderij dan Jong Islamieten Bond. Setelah lulus dari MULO, ia pindah ke Bandung untuk belajar di Algemeene Middelbare School (AMS) hingga tamat pada tahun 1930. Dari tahun 1928 sampai 1932, ia menjadi ketua Jong Islamieten Bond (JIB) Bandung. Ia juga menjadi pengajar setelah memperoleh pelatihan guru selama dua tahun di perguruan tinggi. Ia yang telah mendapatkan pendidikan Islam di Sumatera Barat sebelumnya juga memperdalam ilmu agamanya di Bandung, termasuk dalam bidang tafsir Al-Qur'an, hukum Islam, dan dialektika. Kemudian pada tahun 1932, Natsir berguru pada Ahmad Hassan, yang kelak menjadi tokoh organisasi Persatuan Islam. Pada 20 Oktober 1934, Natsir menikah dengan Nurnahar di Bandung. Dari pernikahan tersebut, Natsir dikaruniai enam anak. Natsir juga diketahui menguasai berbagai bahasa, seperti Inggris, Belanda, Prancis, Jerman, Arab, dan Esperanto. Natsir juga memiliki kesamaan hobi dan memiliki kedekatan dengan Douwes Dekker, yakni bermain musik. Natsir suka memainkan biola dan Dekker suka bermain gitar. Mohammad Natsir juga sering berbicara dalam bahasa Belanda dengan Dekker dan sering membicarakan musik klasik Ludwig van Beethoven dan tulisan karya Boris Leonidovich Pasternak, novelis kenamaan Rusia pada masa itu. Kedekatannya dengan Dekker, menyebabkan Dekker mau masuk Masyumi. Ide-ide Natsir dengan Dekker tentang perjuangan, demokrasi, dan keadilan dinilai sehaluan dengan Natsir. Ia meninggal pada 6 Februari 1993 di Jakarta dan dimakamkan sehari kemudian."
    },
    {
      "name": "Agus Salim",
      "keterangan": "Negarawan dan Diplomat",
      "nama_gelar": "Agus Salim",
      "kategori": "Pahlawan Nasional Indonesia",
      "nama_lengkap": "Agus Salim",
      "lahir":"8 Oktober 1884",
      "wafat":"4 November 1954",
      "riwayat_hidup": "Agus Salim lahir dari pasangan Soetan Salim gelar Soetan Mohamad Salim dan Siti Zainab. Jabatan terakhir ayahnya adalah Jaksa Kepala di Pengadilan Tinggi Riau. Pendidikan dasar ditempuh di Europeesche Lagere School (ELS), sekolah khusus bagi anak-anak Eropa, kemudian dilanjutkan ke Hoogere Burgerschool (HBS) Koning Willem III (Kawedrie) di Batavia. Ketika lulus, ia berhasil menjadi alumnus terbaik di HBS se-Hindia Belanda. Setelah lulus, Salim bekerja sebagai penerjemah dan pembantu notaris pada sebuah kongsi pertambangan di Indragiri. Pada tahun 1906, Salim berangkat ke Jeddah, Arab Saudi untuk bekerja di Duta besar Belanda di sana. Pada periode inilah Salim berguru pada Syaikh Ahmad Khatib, yang masih merupakan pamannya. Pada tahun 1912-1915, Salim membuka sekolah dasar berbahasa Belanda, Hollandsch-Inlandsche School (HIS). Kemudian pada tahun 1915 ia terjun ke dunia jurnalistik di Harian Neratja sebagai Wakil Redaktur. Setelah itu diangkat menjadi Ketua Redaksi. Agus Salim menikah dengan Zaenatun Nahar Almatsier dan dikaruniai 10 orang anak. Kegiatannya dalam bidang jurnalistik terus berlangsung hingga akhirnya menjadi Pemimpin Harian Hindia Baroe di Jakarta. Kemudian mendirikan Surat kabar Fadjar Asia. Dan selanjutnya sebagai Redaktur Harian Moestika di Kota Yogyakarta dan membuka kantor Advies en Informatie Bureau Penerangan Oemoem (AIPO). Bersamaan dengan itu ia juga terjun dalam dunia politik sebagai pemimpin Sarekat Islam.,"
    },
    {
      "name": "Sutan Syahrir",
      "keterangan": "Perdana Menteri Pertama",
      "nama_gelar": "Sutan Syahrir",
      "kategori": "Pahlawan Revolusi Indonesia",
      "nama_lengkap": "Sutan Syahrir",
      "lahir":"5 Maret 1909",
      "wafat":"9 April 1966",
      "riwayat_hidup": "Sjahrir lahir di Padang Panjang, Sumatera Barat dari pasangan Mohammad Rasad dengan gelar Maharaja Soetan bin Leman dan gelar Soetan Palindih dari Koto Gadang, Agam, Sumatera Barat dan Puti Siti Rabiah yang berasal dari negeri Natal, Mandailing Natal, Sumatera Utara. Ayahnya menjabat sebagai penasehat sultan Deli dan kepala jaksa (landraad) di Medan. Sjahrir bersaudara seayah dengan Rohana Kudus, aktivis serta wartawan wanita yang terkemuka. Sjahrir bersaudara kandung dengan Soetan Sjahsam, seorang makelar saham pribumi paling berpengalaman pada masanya dan Soetan Noeralamsjah, seorang jaksa dan politikus Partai Indonesia Raya (Parindra).[4] Sekolah MULO di Medan (sekitar tahun 1925) Sjahrir mengenyam pendidikan di sekolah dasar (ELS) dan sekolah menengah (MULO) terbaik di Medan. Hal ini mengantarkannya kepada berbagai buku-buku asing dan ratusan novel Belanda. Malamnya dia mengamen di Hotel De Boer (kini Hotel Natour Dharma Deli), hotel khusus untuk tamu-tamu Eropa. Pada 1926, ia selesai dari MULO, masuk sekolah lanjutan atas (AMS) di Bandung. Di sekolah itu, dia bergabung dalam Himpunan Teater Mahasiswa Indonesia (Batovis) sebagai sutradara, penulis skenario, dan juga aktor. Hasil mentas itu dia gunakan untuk membiayai sekolah yang ia dirikan, Tjahja Volksuniversiteit (Cahaya Universitas Rakyat). Di kalangan siswa sekolah menengah (AMS) Bandung, Sjahrir menjadi seorang bintang. Sjahrir bukanlah tipe siswa yang hanya menyibukkan diri dengan buku-buku pelajaran dan pekerjaan rumah. Ia aktif dalam klub debat di sekolahnya. Sjahrir juga berkecimpung dalam aksi pendidikan melek huruf secara gratis bagi anak-anak dari keluarga tak mampu dalam Tjahja Volksuniversiteit. Aksi sosial Sjahrir kemudian menjurus jadi politis. Ketika para pemuda masih terikat dalam perhimpunan-perhimpunan kedaerahan, pada tanggal 20 Februari 1927, Sjahrir termasuk dalam sepuluh orang penggagas pendirian himpunan pemuda nasionalis, Jong Indonesië. Perhimpunan itu kemudian berubah nama jadi Pemuda Indonesia yang menjadi motor penyelenggaraan Kongres Pemuda Indonesia, kongres monumental yang mencetuskan Sumpah Pemuda pada 1928."
    },
    {
      "name": "Abdurrahman Wahid",
      "keterangan": "Presiden ke-4 Indonesia",
      "nama_gelar": "Gus Dur",
      "kategori": "Pahlawan Nasional Indonesia",
      "nama_lengkap": "Abdurrahman Wahid",
      "lahir":"7 September 1940",
      "wafat":"30 Desember 2009",
      "riwayat_hidup": "Abdurrahman Wahid merupakan anak dari pasangan Wahid Hasyim dan Solichah. Ia lahir pada tanggal 4 Syakban 1359 Hijirah. Dalam kalender Masehi, Abdurrahman Wahid lahir pada tanggal 7 September 1940. Kisah tentang tanggal lahir beliau terbilang cukup unik. Meski Gus Dur lahir pada tanggal 7 September, sejumlah orang masih merayakan hari ulang tahun Gus Dur pada 4 Agustus. Tempat kelahirannya di pesantren milik kakek dari pihak ibunya yang bernama Bisri Syansuri. Pesantren ini terletak di Denanyar Jombang, Jawa Timur Ia lahir dengan nama Abdurrahman Addakhil. Addakhil berarti Sang Penakluk. Kata Addakhil tidak cukup dikenal dan diganti nama Wahid, dan kemudian lebih dikenal dengan panggilan Gus Dur. Gus adalah panggilan kehormatan khas pesantren kepada seorang anak kiai yang berati abang atau mas. Gus Dur adalah putra pertama dari enam bersaudara. Gus Dur lahir dalam keluarga yang sangat terhormat dalam komunitas Muslim Jawa Timur. Kakek dari ayahnya adalah K.H. Hasyim Asyari, pendiri Nahdlatul Ulama (NU), sementara kakek dari pihak ibu, K.H. Bisri Syansuri, adalah pengajar pesantren pertama yang mengajarkan kelas pada perempuan. Ayah Gus Dur, K.H. Wahid Hasyim, terlibat dalam Gerakan Nasionalis dan menjadi Menteri Agama tahun 1949. Ibunya, Ny. Hj. Sholehah, adalah putri pendiri Pondok Pesantren Denanyar Jombang. Saudaranya adalah Salahuddin Wahid dan Lily Wahid. Ia menikah dengan Sinta Nuriyah dan dikaruniai empat putri: Alisa, Yenny, Anita, dan Inayah. Gus Dur secara terbuka pernah menyatakan bahwa ia memiliki darah Tionghoa. Abdurrahman Wahid mengaku bahwa ia adalah keturunan dari Tan Kim Han yang menikah dengan Tan A Lok, saudara kandung Raden Patah (Tan Eng Hwa), pendiri Kesultanan Demak. Tan A Lok dan Tan Eng Hwa ini merupakan anak dari Putri Campa, puteri Tiongkok yang merupakan selir Raden Brawijaya V. Tan Kim Han sendiri kemudian berdasarkan penelitian seorang peneliti Prancis, Louis-Charles Damais diidentifikasikan sebagai Syekh Abdul Qodir Al-Shini yang diketemukan makamnya di Trowulan."
    },
    {
      "name": "Bung Tomo",
      "keterangan": "Pemimpin Rakyat Surabaya",
      "nama_gelar": "Bung Tomo",
      "kategori": "Pahlawan Revolusi Indonesia",
      "nama_lengkap": "Sutomo",
      "lahir":"3 Oktober 1920",
      "wafat":"7 Oktober 1981",
      "riwayat_hidup": "Sutomo dilahirkan di Kampung Blauran, Surabaya. Ayahnya bernama Kartawan Tjiptowidjojo, priyayi golongan menengah yang pernah bekerja sebagai pegawai pemerintah, staf perusahaan swasta, asisten kantor pajak, hingga pegawai perusahan ekspor-impor Belanda. Kartawan mengaku mempunyai pertalian darah dengan beberapa pengikut dekat Pangeran Diponegoro. Ibu Sutomo bernama Subastita, seorang perempuan berdarah campuran Jawa Tengah, Sunda, dan Madura anak seorang distributor lokal mesin jahit SINGER di wilayah Surabaya yang sebelum pindah ke Surabaya pernah jadi polisi kotapraja dan anggota Sarekat Islam. Sutomo sulung dari 6 orang bersaudara. Adiknya masing-masing bernama Sulastri, Suntari, Gatot Suprapto, Subastuti, dan Hartini. Walaupun dibesarkan dalam keluarga yang sangat menghargai pendidikan, tetapi pada usia 12 tahun, Sutomo terpaksa meninggalkan bangku MULO akibat dampak Despresi Besar yang melanda dunia. Untuk membantu keluarga, ia mulai bekerja secara serabutan. Meski begitu, belakangan Sutomo bisa masuk HBS secara korespondensi dan tercatat sebagai murid yang dianggap lulus meski tidak secara resmi. Sutomo lalu bergabung dengan KBI (Kepanduan Bangsa Indonesia). Pada usia 17 tahun, ia berhasil menjadi orang kedua di Hindia Belanda yang mencapai peringkat Pramuka Garuda. Sebelum pendudukan Jepang pada 1942, peringkat ini hanya dicapai oleh tiga orang Indonesia. Sutomo muda lebih banyak berkecimpung dalam bidang kewartawanan. Ia antaranya menjadi jurnalis lepas untuk harian Soeara Oemoem, harian berbahasa Jawa Ekspres, mingguan Pembela Rakyat, dan majalah Poestaka Timoer."
    },
    {
      "name": "Otto Iskandardinata",
      "keterangan": "Panglima Divisi Siliwangi",
      "nama_gelar": "Otto Iskandardinata",
      "kategori": "Pahlawan Revolusi Indonesia",
      "nama_lengkap": "Raden Otto Iskandardinata",
      "lahir":"31 Maret 1897",
      "wafat":"??",
      "riwayat_hidup": "Otto Iskandardinata lahir 31 Maret 1897 di Bojongsoang, Kabupaten Bandung. Otto merupakan anak bungsu dari pasangan Raden haji Adam Rahmat dan Siti Hidayah. Ia menyelesaikan pendidikannya di Sekolah Guru Atas. Setelah itu, ia mengajar di HIS bersubsidi serta perkumpulan Perguruan Rakyat.Raden otto iskandardinata mendapat julukan si Jalak Harapat. Dalam kegiatan pergarakannya pada masa sebelum kemerdekaan, Otto pernah menjabat sebagai Wakil Ketua Budi Utomo cabang Bandung pada periode 1921-1924 dan Wakil Ketua Budi Utomo cabang Pekalongan tahun 1924. Ketika itu, ia menjadi anggota Gemeenteraad (Dewan Kota) Pekalongan mewakili Budi Utomo. Oto juga aktif pada organisasi Budaya Sunda bernama Paguyuban Pasundan. Ia menjadi Sekretaris Pengurus Besar tahun 1928, dan menjadi ketuanya pada periode 1929-1942. Organisasi tersebut bergerak dalam bidang pendidikan, sosial-budaya, politik, ekonomi, kepemudaan, dan pemberdayaan perempuan. Otto juga menjadi anggota Volksraad (Dewan Rakyat) yang dibentuk pada masa Hindia Belanda untuk periode 1930-1941. Pada masa penjajahan Jepang, Otto menjadi Pemimpin surat kabar Tjahaja (1942-1945). Ia kemudian menjadi anggota BPUPKI dan PPKI yang dibentuk oleh pemerintah pendudukan Jepang sebagai lembaga-lembaga yang membantu persiapan kemerdekaan Indonesia. Setelah proklamasi kemerdekaan, Otto menjabat sebagai Menteri Negara di kabinet pertama Republik Indonesia tahun 1945. Ia bertugas mempersiapkan terbentuknya BKR dari laskar-laskar rakyat yang tersebar di seluruh Indonesia. Dalam periode tugasnya, terdapat ketidakpuasan pada salah satu laskar. Otto menjadi korban penculikan sekelompok orang yang bernama Laskar Hitam, Otto kemudian hilang dan diperkirakan terbunuh di daerah Mauk, Tangerang, Banten."
    },
    {
      "name": "Soepomo",
      "keterangan": "Perancang UUD 1945",
      "nama_gelar": "Prof. Dr. Mr. Soepomo",
      "kategori": "Pahlawan Nasional Indonesia",
      "nama_lengkap": "Soepomo",
      "lahir":"22 Januari 1903",
      "wafat":"12 September 1958",
      "riwayat_hidup": "Soepomo dilahirkan pada 22 Januari 1903, di Sukoharjo, Hindia Belanda (sekarang Indonesia). Ia berasal dari keluarga priyayi; kakek dari pihak ibu dan ayah keduanya adalah pejabat tinggi pemerintah. Ia memulai pendidikannya pada tahun 1917, ketika ia terdaftar di Europeesche Lagere School (ELS) di Boyolali. Ia lulus pada tahun 1920, dan melanjutkan studinya ke Meer Uitgebreid Lager Onderwijs (MULO) di Surakarta. Pada tahun 1923, ia pindah ke Batavia (sekarang Jakarta) dan bersekolah di Bataviasche Rechtsschool. Setelah lulus dari sana, ia bekerja di sebuah pengadilan negeri di Surakarta, sebelum berangkat ke Belanda untuk melanjutkan pendidikan. Di Belanda, ia mendaftar di Universitas Leiden, dan belajar hukum di bawah Cornelis van Vollenhoven. Ia lulus pada tahun 1927, dengan tesisnya yang berjudul Reformasi Sistem Agraria di Wilayah Surakarta, yang berisi uraian tentang sistem agraria di Surakarta dan kritik terselubung terhadap kolonialisme Belanda. Sekembalinya ke rumah, ia menjadi pegawai pengadilan di Yogyakarta, kemudian dipindahkan ke Departemen Kehakiman di Batavia. Saat bertugas di Departemen Kehakiman, ia mengambil pekerjaan sampingan sebagai dosen tamu di Rechtshoogeschool. Ia kemudian bergabung dengan asosiasi pemuda Jong Java, dan menulis sebuah makalah berjudul Perempuan Indonesia dalam Hukum, yang ia presentasikan bersama dengan Perdana Menteri di kemudian hari Ali Sastroamidjojo pada Kongres Perempuan 1928."
    },
    {
      "name": "Soetomo",
      "keterangan": "Pendiri Budi Utomo",
      "nama_gelar": "Dr. Soetomo",
      "kategori": "Pahlawan Nasional Indonesia",
      "nama_lengkap": "Soetomo",
      "lahir":"30 Juli 1888",
      "wafat":"30 Mei 1938",
      "riwayat_hidup": "dr. Soetomo atau Soebroto (30 Juli 1888 – 30 Mei 1938 ) adalah tokoh pendiri Budi Utomo, organisasi pergerakan yang pertama di Indonesia. Soebroto mengganti namanya menjadi Soetomo saat masuk ke sekolah menengah.[1] Pada tahun 1903, Soetomo menempuh pendidikan kedokteran di School tot Opleiding van Inlandsche Artsen, Batavia. Bersama kawan-kawan dari STOVIA inilah Soetomo mendirikan perkumpulan yang bernama Budi Utomo, pada tahun 1908. Setelah lulus pada tahun 1911, ia bekerja sebagai dokter pemerintah di berbagai daerah di Jawa dan Sumatra. Pada tahun 1917, Soetomo menikah dengan seorang perawat Belanda. Pada tahun 1919 sampai 1923, Soetomo mendapatkan beasiswa dan melanjutkan studi spesialis kedokteran di Universitas Amsterdam. Selama kuliah, Soetomo ikut berkegiatan di Indische Vereeniging. Soetomo juga sempat dipilih menjadi ketua Indische Vereeniging periode 1921–1922. Pada tahun 1923, Soetomo kembali ke Indonesia dan menjadi pengajar di Nederlandsch Artsen School (NIAS). Pada tahun 1924, Soetomo mendirikan Indonesian Study Club (dalam bahasa Belanda Indonesische Studie Club atau Kelompok Studi Indonesia) di Surabaya. Pada tahun 1930, Indonesische Studie Club mengubah namanya jadi Partai Bangsa Indonesia dan pada tahun 1935, mendirikan Parindra (Partai Indonesia Raya)."
    },
    {
      "name": "Sayuti Melik",
      "keterangan": "Pejuang Kemerdekaan",
      "nama_gelar": "Sayuti Melik",
      "kategori": "Pahlawan Nasional Indonesia",
      "nama_lengkap": "Sayuti Melik",
      "lahir":"25 November 1908",
      "wafat":"27 Februari 1989",
      "riwayat_hidup": "Dilahirkan pada tanggal 22 November 1908, anak dari Abdul Mu'in alias Partoprawito, seorang bekel jajar atau kepala desa di Sleman, Yogyakarta. Sedangkan ibunya bernama Sumilah. Pendidikan dimulai dari Sekolah Ongko Loro (Setingkat SD) di desa Srowolan, sampai kelas IV dan diteruskan sampai mendapat Ijazah di Yogyakarta. Nasionalisme sudah sejak kecil ditanamkan oleh ayahnya kepada Sayuti kecil. Ketika itu ayahnya menentang kebijaksanaan pemerintah Belanda yang menggunakan sawahnya untuk ditanami tembakau. Ketika belajar di sekolah guru di Solo, 1920, ia belajar nasionalisme dari guru sejarahnya yang berkebangsaan Belanda, H.A. Zurink. Pada usia belasan tahun itu, ia sudah tertarik membaca majalah Islam Bergerak pimpinan K.H. Misbach di Kauman, Solo, ulama yang berhaluan kiri. Ketika itu banyak orang, termasuk tokoh Islam, memandang Marxisme sebagai ideologi perjuangan untuk menentang penjajahan. Dari Kiai Misbach ia belajar Marxisme. Perkenalannya yang pertama dengan Bung Karno terjadi di Bandung pada 1926. Tulisan-tulisannya mengenai politik menyebabkan ia ditahan berkali-kali oleh Belanda. Pada tahun 1926 ditangkap Belanda karena dituduh membantu PKI dan selanjutnya dibuang ke Boven Digul (1927-1933). Tahun 1936 ditangkap Inggris, dipenjara di Singapura selama setahun. Setelah diusir dari wilayah Inggris ditangkap kembali oleh Belanda dan dibawa ke Jakarta, dimasukkan sel di Gang Tengah (1937-1938). Sepulangnya dari pembuangan, Sayuti berjumpa dengan SK Trimurti, dan terlibat dalam berbagai kegiatan pergerakan secara bersama. Akhirnya pada 19 Juli 1938 mereka menikah. Pada tahun itu juga Mereka mendirikan koran Pesat di Semarang yang terbit tiga kali seminggu dengan tiras 2 ribu eksemplar. Karena penghasilannya masih kecil, pasangan suami-istri itu terpaksa melakukan berbagai pekerjaan, dari redaksi hingga urusan percetakan, dari distribusi dan penjualan hingga langganan. Trimurti dan Sayuti Melik bergiliran masuk keluar penjara akibat tulisan mereka mengkritik tajam pemerintah Hindia Belanda. Sayuti sebagai bekas tahanan politik yang dibuang ke Boven Digul selalu dimata-matai dinas intel Belanda (PID). Pada zaman pendudukan Jepang, Maret 1942 koran Pesat diberedel Japan, Trimurti ditangkap Kempetai, Jepang juga mencurigai Sayuti sebagai orang komunis. Pada 9 Maret 1943, diresmikan berdirinya Putera (Pusat Tenaga Rakyat) dipimpin “Empat Sekawan” Soekarno, Moh. Hatta, Ki Hadjar Dewantara, dan Kiai Mas Mansoer. Saat itu Soekarno meminta pemerintah Jepang membebaskan Trimurti, lalu membawanya ke Jakarta untuk bekerja di Putera, dan kemudian di Djawa Hookoo Kai, Himpunan Kebaktian Rakyat Seluruh Jawa. Dan lalu Trimurti dan Sayuti Melik dapat hidup relatif tenteram. Sayuti terus berada di sisi Bung Karno."
    },
    {
      "name": "Sukarni Kartodiwirjo",
      "keterangan": "Pemimpin Angkatan Darat",
      "nama_gelar": "Sukarni Kartodiwirjo",
      "kategori": "Pahlawan Nasional Indonesia",
      "nama_lengkap": "Sukarni Kartodiwirjo",
      "lahir":"14 Juli 1916",
      "wafat":"7 Mei 1971",
      "riwayat_hidup":"Sukarni lahir hari Kamis Wage di desa Sumberdiran, Kecamatan Garum, Kabupaten Blitar, Jawa Timur. Namanya jika dijabarkan berarti 'Su' artinya lebih sedangkan 'Karni' artinya banyak memperhatikan dengan tujuan oleh orangtuanya agar Sukarni lebih memperhatikan nasib bangsanya yang kala itu masih dijajah Belanda. Sukarni merupakan anak keempat dari sembilan bersaudara. Sukarni masuk sekolah di Mardisiswo di Blitar (semacam Taman Siswa yang dibuat oleh Ki Hajar Dewantara). Di sekolah ini Sukarni belajar mengenai nasionalisme melalui Moh. Anwar yang berasal dari Banyumas, pendiri Mardidiswo sekaligus tokoh pergerakan Indonesia. Pada pendidikan inilah jiwa nasionalisme Sukarni tumbuh, ditambah pemikiran orang di sekitarnya seperti dari seorang guru bernama Mohammad Anwar yang memiliki sikap antikolonialisme Belanda. Setelah menyelesaikan studi dari Mardisiswo, Sukarni melanjutkan sekolah ke HIS (Hollandsch-Inlandsche School) di Blitar. Kemudian Sukarni meneruskan pendidikan ke MULO (Meer Uitgebreid Lager Onderwijs) masih di kota yang sama, memiliki minat di bidang pendidikan maka ia melanjutkan ke Kweekschool atau Sekolah Guru dan Volks Universiteit atau Universitas Rakyat. Sebagai anak muda, Sukarni terkenal karena kebiasaannya sering berbuat onar. Dia sering berkelahi dan senang menantang orang Belanda. Dia pernah mengumpulkan 30-50 orang teman-temannya dan mengirim surat tantangan ke anak muda Belanda untuk berkelahi. Lokasinya di kebun raya Blitar, dekat sebuah kolam. Anak-anak Belanda menerima tantangan itu dan terjadilah tawuran. Kelompok Sukarni memenangkan perkelahian itu dan anak Belanda yang kalah dicemplungkan ke kolam."
    }
  ]
  